/**
 * Created by georgehupeijie on 2018/1/25.
 */
export default {
  name: "胡佩杰",
  titleInfos: [
    {
      label: "目前公司",
      value: "唯品会(中国)有限公司",
    },
    {
      label: "目前职位",
      value: "高级前端开发工程师",
    },
    {
      label: "工作年限",
      value: "11年"
    }
  ],
  baseInfos: [
    {
      label: "年龄",
      value: "33",
    },
    {
      label: "婚姻状况",
      value: "已婚",
    },
    {
      label: "手机",
      value: "13661598594",
    },
    {
      label: "邮箱",
      value: "hupeijiegeorge@hotmail.com",
    },
    {
      label: "国籍",
      value: "中国",
    },
    {
      label: "居住地",
      value: "上海市宝山区",
    },
    {
      label: "户籍",
      value: "上海",
    }
  ],
  careerExperiences: [
    {
      from: "2016.09",
      to: "至今",
      company: "唯品会(中国)有限公司",
      companyInfos: [
        {
          label: "公司简介",
          value: "<p>唯品会简介：—— 全球最大闪购网站，中国上市互联网公司Top 5。</p>" +
          "<p>唯品会，一家专门做特卖的网站，成立于2008年08月，2012年3月23日登陆美国纽约证券交易所上市（股票代码：VIPS）。" +
          "成为华南第一家在美国纽交所上市的电子商务企业，到2014年已连续9个季度盈利，股价从2012年5$/股，一路涨到2014年底260$/股。" +
          "www.vip.com云集上千全球买手，汇集全球几千家一、二线品牌商品，其中上千家为独家授权品牌，品类涵盖服饰、箱包、美妆、母婴、家居、" +
          "食品、旅游、3C等应有尽有，打造网络Outlets，让正品，名牌，特价不再遥远。目前会员已超1亿，复购率高达70%以上。</p>"
        },
        {
          label: "公司性质",
          value: "私营·民营企业"
        },
        {
          label: "公司规模",
          value: "5000-10000人"
        },
        {
          label: "公司行业",
          value: "互联网/移动互联网/电子商务"
        }
      ],
      careers: [
        {
          position: "高级前端工程师",
          from: "2016.09",
          to: "至今",
          careerInfos: [
            {
              label: "工作地点",
              value: "上海"
            },
            {
              label: "所在部门",
              value: "数据应用与服务部"
            },
            {
              label: "下属人数",
              value: "2"
            },
            {
              label: "职责业绩",
              value: [
                "负责唯品数坊、魔方罗盘两个项目的前端开发工作，按计划完成版本迭代",
                "制定前端开发规范",
                "负责前端样式框架搭建",
                "负责维护私有npm库，开发、维护前端组件库",
                "负责前端工程化搭建，包括前后端分离、前端关键组件单元测试"
              ]
            },
          ]
        }
      ]
    },
    {
      from: "2016.03",
      to: "2016.09",
      company: "欣和",
      companyInfos: [
        {
          label: "公司简介",
          value: "在调味品行业，成为最有实力、最有影响力、人人尊重的公司。"
        },
        {
          label: "公司性质",
          value: "私营·民营企业"
        },
        {
          label: "公司规模",
          value: "100-499人"
        },
        {
          label: "公司行业",
          value: "互联网/移动互联网/电子商务"
        }
      ],
      careers: [
        {
          position: "互联网软件开发工程师",
          from: "2016.03",
          to: "2016.09",
          careerInfos: [
            {
              label: "工作地点",
              value: "上海"
            },
            {
              label: "下属人数",
              value: "2"
            },
            {
              label: "职责业绩",
              value: [
                "负责欣和社区购、Rportal移动端开发及运维工作",
                "负责一米市集物流系统开发",
                "负责前端页面设计，核心业务代码编写，组内开发职责分工，代码质量检查，代码版本管理，持续优化前端体验和页面响应速度，并保证浏览器兼容性"
              ]
            }
          ]
        }
      ]
    },
    {
      from: "2007.09",
      to: "2016.02",
      company: "上海宝信软件股份有限公司",
      companyInfos: [
        {
          label: "公司简介",
          value: "<p>上海宝信软件股份有限公司（简称“宝信软件”）系宝钢股份控股的上市软件企业，于2001年4月上市。" +
          "公司总部位于上海浦东张江高科技园区，注册资本3.64亿元人民币，是国家规划布局内重点软件企业。</p>" +
          "<p>公司已累记申请专利321项、软件著作权登记422项、技术秘密认定237项，并一直承担着国家科技重大专项、" +
          "国家科技支撑计划专项、国家科技部863专项、国家工信部电子基金专项等从国家到地方的研发和产业化类项目。</p>" +
          "<p>宝信软件秉承“IT服务，提升信息价值”的服务理念，全面提供企业信息化、自动化系统集成及运维，城市智能交通、" +
          "路桥隧监控、轨道交通监控，机电工程总包、机电一体化产品及机电设备维修等方面的综合解决方案。产品与服务业绩遍及钢铁、" +
          "交通、服务外包、采掘、有色、石化、装备制造（含造船）、资源、金融、公共服务等多个行业。凭借30多年的经验和技术积累，" +
          "公司正致力于云计算、物联网、车联网、智能制造、绿色制造、智慧园区等关键技术研发与应用，提供SaaS、BOO等IT行业新兴服务模式，" +
          "持续为用户提供增值服务，与用户共同成长。</p>"
        },
        {
          label: "公司性质",
          value: "国内上市公司"
        },
        {
          label: "公司规模",
          value: "2000-5000人"
        },
        {
          label: "公司行业",
          value: "互联网/移动互联网/电子商务"
        }
      ],
      careers: [
        {
          position: "软件开发工程师",
          from: "2007.09",
          to: "2016.02",
          careerInfos: [
            {
              label: "工作地点",
              value: "上海"
            },
            {
              label: "下属人数",
              value: "2"
            },
            {
              label: "职责业绩",
              value: [
                "负责宝钢全员报支系统、宝钢财务系统项目应付模块的产品设计、开发与运维",
                "负责代码质量验收",
                "管理代码版本库",
                "负责配合系统打包部署工作"
              ]
            }
          ]
        }
      ]
    }
  ],
  educations: [
    {
      name: "华东理工大学",
      from: "2003.09",
      to: "2007.07",
      educationInfos: [
        {
          label: "专业名称",
          value: "信息管理与信息系统"
        },
        {
          label: "学历",
          value: "本科"
        },
        {
          label: "是否统招",
          value: "是"
        }
      ]
    }
  ],
  projectsExperiences: [
    {
      projectName: "新魔方罗盘",
      from: "2017.07",
      to: "至今",
      projectInfos: [
        {
          label: "项目职务",
          value: "前端开发"
        },
        {
          label: "项目描述",
          value: "魔方罗盘系统是面向供应商的数据可视化产品，用于提供供应商查看各商品销售档期的实时和离线数据，并引导供应商基于反馈数据做出更为合适的售卖策略。<br>" +
          "旧版魔方罗盘系统前端基于jade + knockout + jquery + gulp开发，技术陈旧，页面设计风格过时，用户体验待改进之处也较多。<br>" +
          "新版前端技术使用vue + element-ui + echarts，历时5个月逐步将所有旧版本页面全数替换，完成系统前端界面的蜕变。"
        },
        {
          label: "项目职责",
          value: [
            "完成新版魔方罗盘前端开发的框架搭建，制定前端开发规范",
            "负责前端工程化相关任务（前后端分离，单元测试等）",
            "负责魔方罗盘前端开发工作，按计划完成系统每月版本迭代",
            "负责前端共用组件开发"
          ],
        },
        {
          label: "项目业绩",
          value: [
            "项目期间积累了大量基于vue的高可复用组件，大幅提升后期前端开发效率",
            "抽象、规范数据可视化各种图例的数据结构，封装echarts，节省前后端后期开发成本",
            "对element-ui各组件(table，tabs，datePicker等等)做定制化封装，同时也向element-ui开源项目贡献了一点微薄之力",
            "项目期间被公司评为2017年第三季度优秀员工"
          ]
        }
      ]
    },
    {
      projectName: "唯品数坊",
      from: "2016.09",
      to: "2017.06",
      projectInfos: [
        {
          label: "项目职务",
          value: "高级前端工程师"
        },
        {
          label: "项目描述",
          value: "该系统是唯品会大数据平台基础项目，为各部门和系统获取业务数据、做数据统计及分析提供平台。"
        },
        {
          label: "项目职责",
          value: [
            "负责数坊系统前端开发工作，按计划完成系统每月版本迭代",
            "负责前端代码重构和样式库搭建",
            "参与落地前后端开发及部署分离，构建mock环境，规范开发流程，提高前后端开发效率",
            "搭建私有npm库，与同事一同制定前端组件开发及发布规范，负责管理部门内部前端组件库"
          ],
        },
        {
          label: "项目业绩",
          value: [
            "将seajs更换为requirejs，抽象原系统中各种组件，完成前端代码重构",
            "参考bootstrap，element-ui，bulma等优秀开源框架，开发完成一条定制化样式框架，基于该样式框架完成前端界面重构",
            "该项目前端重构后被提名年度最佳用户体验奖，获过众多赞誉",
            "使用jasmine + morkjs + karma搭建单元测试环境，持续对已完成抽象的公共组件编写单元测试用例，代码测试覆盖率60%+，并结合公司内部系统部署平台实现一键测试+打包+发布。" +
            "数坊为部门内部首个部署前端单元测试的项目，引其他项目组借鉴，提升部门整体前端代码质量"
          ]
        }
      ]
    },
    {
      projectName: "一米市集微商城改版",
      from: "2016.05",
      to: "2016.07",
      projectInfos: [
        {
          label: "项目职务",
          value: "软件开发工程师"
        },
        {
          label: "项目描述",
          value: "一米市集微商城为一米市集移动端电商平台。项目对一米市集微商城移动端页面进行UI改版，增加团购、专题活动页面及相应功能。"
        },
        {
          label: "项目职责",
          value: "负责微商城移动端团购、专题活动两个模块的开发，负责代码版本库管理。"
        },
        {
          label: "项目业绩",
          value: "项目期间微商城首页加载速度一直被人诟病。了解情况后，主动从前端社区中了解淘宝首页和百度首页的一些首屏优化的方案和思路，结合项目现状，" +
          "设计出从后端到前端一套可行方案后，提出对首页进行优化，并独立完成首页首屏加载提速由原先5秒以上减少到300毫秒以下。"
        }
      ]
    },
    {
      projectName: "一米市集物流管理系统开发",
      from: "2016.04",
      to: "2016.05",
      projectInfos: [
        {
          label: "项目职务",
          value: "软件开发工程师"
        },
        {
          label: "项目描述",
          value: "物流管理系统（TMS）负责管理运单生命周期，从运单创建或从其他系统接口接受运单信息，运单分配司机车辆、司机扫二维码派送，" +
          "到客户扫码签收。系统前端基于seaJs和bootstrap，后端为springMVC+mybatis，数据库mysql。"
        },
        {
          label: "项目职责",
          value: "设计库表结构，完成PC端前后端、移动端开发工作，兼任产品经理职务与用户沟通确认需求及方案。" +
          "负责前端架构搭建，根据美工绘制demo编写静态页面，通过ajax完成前后端数据交互，编写后端接口。"
        }
      ]
    },
    {
      projectName: "欣和社区购及R-Portal系统开发及运维",
      from: "2016.03",
      to: "2016.04",
      projectInfos: [
        {
          label: "项目职务",
          value: "软件开发工程师"
        },
        {
          label: "项目描述",
          value: "社区购为欣和移动端电商平台；R-portal系统负责汇总订单信息并提供给社区商家抢单，" +
          "跟踪订单发货记录，商家收货记录，以及商家的发货记录，订单签收后两个系统同步签收状态。系统前端基于seaJs和bootstrap，" +
          "后端为springMVC+mybatis，数据库oracle。"
        },
        {
          label: "项目职责",
          value: "根据产品经理要求完成前后端开发工作。负责产品首页的二次开发及优化，抽象前端组件，提升代码的可维护性和复用性。"
        }
      ]
    },
    {
      projectName: "宝钢金属财务系统覆盖",
      from: "2014.01",
      to: "2016.01",
      projectInfos: [
        {
          label: "项目职务",
          value: "软件开发工程师"
        },
        {
          label: "项目描述",
          value: "财务系统覆盖宝钢金属37家公司。实现宝钢金属资金帐管理；实现会计工厂化任务管理，提高财务工作效率。与宝钢国旅对接完成机票统一结算。"
        },
        {
          label: "项目职责",
          value: "负责与宝钢国旅方共同开发，实现机票统一结算的整套流程。"
        },
        {
          label: "项目业绩",
          value: "期间参与编写页面js代码过程中发现团队的js技术为薄弱点，可能面临的前端问题会对项目组带来不可控风险，" +
          "开始计划并组织团队，耗时半年完成js系统性学习，为项目组后续开发效率及质量带来质的提升。"
        }
      ]
    },
    {
      projectName: "新疆八钢集团及梅钢财务系统覆盖",
      from: "2012.01",
      to: "2013.12",
      projectInfos: [
        {
          label: "项目职务",
          value: "软件开发工程师"
        },
        {
          label: "项目描述",
          value: "财务系统覆盖新疆八钢集团86家公司及梅钢36家公司。实现集团内部往来清算管理；支持全集团范围的收付结算协同；满足八钢资金结算等个性化管理需求；增强梅山财务管理功能，满足梅山资金控制等管理需求。"
        },
        {
          label: "项目职责",
          value: "负责众多公司需求收集分析，基本设计编制，任务分配、进度跟踪、代码编写、代码review。"
        }
      ]
    },
    {
      projectName: "宝钢工程集团财务系统覆盖",
      from: "2010.01",
      to: "2011.12",
      projectInfos: [
        {
          label: "项目职务",
          value: "软件开发工程师"
        },
        {
          label: "项目描述",
          value: "财务一体化系统覆盖宝钢工程集团公司：应付模块核心代码以面向对象思想重构；" +
          "实现系统与财务公司对接，完成银企直连功能。实现灵活可配置的报销审批流程管理。"
        },
        {
          label: "项目职责",
          value: "负责需求分析及基本设计；梳理核心业务逻辑，负责核心代码重构及测试工作；负责银企直连财务系统相关代码编程及测试。"
        }
      ]
    },
    {
      projectName: "宝钢全员报支系统",
      from: "2008.10",
      to: "2009.12",
      projectInfos: [
        {
          label: "项目职务",
          value: "软件开发工程师"
        },
        {
          label: "项目描述",
          value: "基于宝钢财务系统应付模块中的报销功能，开发完成全员报支系统。该系统面向宝钢内部全体员工，供员工自行报销，节省财务成本。" +
          "系统涉及业务复杂，包括费用控制、预算控制、审批流控制、机票统一结算等。"
        },
        {
          label: "项目职责",
          value: "宝钢全员报支系统产品设计、开发与维护。"
        }
      ]
    },
    {
      projectName: "宝钢财务一体化项目",
      from: "2007.09",
      to: "2008.09",
      projectInfos: [
        {
          label: "项目职务",
          value: "软件开发工程师"
        },
        {
          label: "项目描述",
          value: "系统包含总账、应收、应付、票据、现金、库存等模块。与宝钢销售一体化、宝钢物流一体化一起搭建宝钢信息化基础平台。"
        },
        {
          label: "项目职责",
          value: "财务一体化系统应付模块产品设计、开发与维护。"
        }
      ]
    }
  ],
  selfAppraisal: "<p>信息管理与信息技术专业出身，毕业后至今一直从事软件领域相关工作，做过7年大型erp系统开发，" +
  "负责系统核心业务模块的需求分析，功能设计，前后端代码编写与测试，后转向互联网行业。</p>" +
  "<p>对业务需求有很强的把控力，对产品设计与用户交互体验有特别细致的追求，" +
  "对代码质量有种强迫症似的要求。个人爱好从事前端相关工作，喜欢设计构思更好更人性化的人机交互方式，乐于自学和尝试新技术，并尽可能用于改善现有功能或解决工作中遇到的遗留问题。</p>" +
  "<p>精通html，javascript，css前端核心基础技术语言，熟练使用es6，vuejs，jquery，requirejs，gulp，webpack等技术，喜欢研究源码，弄清技术背后的真相，对前端框架有较深刻理解。" +
  "对前端技术抱有极大兴趣并持续从社区和github学习相关新技术。对数据可视化技术有研究，精通svg及canvas技术。" +
  "后端技术熟练使用java，熟悉spring MVC和mybatis，可与后端无障碍沟通。</p>" +
  "<p>善于利用碎片化时间学习相关领域的技术知识，了解前端前沿技术。乐于将所学梳理总结成文（https://segmentfault.com/u/georgehpj/articles）。</p>" +
  "<p>作为技术人员，崇尚脚踏实地，赞赏不耻下问，不浮躁，与人和善，遇问题对事不对人。乐于和朝气蓬勃的团队一起奋斗。</p>"
}
